// ДЗ №1.
// // Задача №1. Задать температуру в градусах по Цельсию. Вывести в alert соответствующую температуру в градусах по Фаренгейту. Подсказка: расчёт идёт по формуле: Tf = (9 / 5) * Tc + 32, где Tf – температура по Фаренгейту, Tc – температура по Цельсию
// let Tc = prompt('Задайте температуру в градусах цельсия.');
// let Tf = (9 / 5) * Tc + 32;
// alert(Tf);



// // Задача №2. Работа с переменными. Объявить две переменные: admin и name. Записать в name строку "Василий"; Скопировать значение из name в admin. Вывести admin (должно вывести «Василий»).
// let admin;
// let name = 'Василий';
// admin = name;
// alert(admin);


// //Задача №3. *Чему будет равно JS-выражение 1000 + "108"
// // Выражение бутет равно '1000108';


// //Задача №4. *Самостоятельно разобраться с атрибутами тега script (async и defer)
// //Разница в том, что async загружает скрипт асинхронно, а defer откладывает выполнение скрипта до полной загрузки страницы.