// Задача №1. С помощью цикла while вывести все простые числа в промежутке от 0 до 100.

function getSimpleNumbers(i) {
    while (i < 100) {
        i++;
        checkSimpleNumber(i)
    };
}

function checkSimpleNumber(n) {
    if (n == 1 || (n % 2 == 0 && n != 2) || (n % 3 == 0 && n != 3) || (n % 5 == 0 && n != 5) || (n % 7 == 0 && n != 7)) {;
    } else console.log(n);
}
getSimpleNumbers(0);

// Не изящное решение, сам вижу, но надо сдавать решение - код работает, додумаю позже или посмотрю разбор дз.

// Задаяа №2. С этого урока начинаем работать с функционалом интернет - магазина.Предположим, есть сущность корзины.Нужно реализовать функционал подсчета стоимости корзины в зависимости от находящихся в ней товаров.
// Товары в корзине хранятся в массиве. 
// Задачи:
// a) Организовать такой массив для хранения товаров в корзине;

const cart = [
    ['bicycle', '1000', '2'],
    ['ball', '350', '3'],
    ['snikers', '299', '5'],
    ['socks', '4.95', '12']
]


// b) Организовать функцию countBasketPrice, которая будет считать стоимость корзины.

function countCartPrice(cart) {
    var sumPrice = 0;
    for (let i = 0; i < cart.length; i++) {
        sumPrice += cart[i][1] * cart[i][2];
    }
    return sumPrice;
}

countCartPrice(cart);


// Задача №4.*Вывести с помощью цикла for числа от 0 до 9, не используя тело цикла. Выглядеть это должно так: 

// for(…){// здесь пусто}

for (let i = 0; i <= 9; console.log(i++)) {}


// Задача №5. *Нарисовать пирамиду с помощью console.log, как показано на рисунке, только у вашей пирамиды должно быть 20 рядов, а не 5:
// x
// xx
// xxx
// xxxx
// xxxxx

function letDrawPiramid(n) {
    let result = '';
    for (let i = 1; i <= n; i++) {
        result += '*'
        console.log(result + '\n')
    }
}
letDrawPiramid(20);